# FormElemRegenSelfIntersection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FormFailures..::..FormElemRegenSelfIntersection Property
BuiltInFailures..::..FormFailures Class See Also
---
Unable to create form element: self-intersecting or singular geometry would result.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FormElemRegenSelfIntersection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FormElemRegenSelfIntersection As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FormElemRegenSelfIntersection {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FormFailures Class
Autodesk.Revit.DB Namespace